sechmo/esp32RF/lib/RFDriver/RFDriver.cpp
    // Check for error
    if ((prescaler == 6) || (ulticks < 2) || (ulticks > max_ticks))
    {
        // signal fault
        *nticks = 0;
        return 0;
    }

    *nticks = ulticks;
    return prescaler;
#else
    return 0; // not implemented or needed on other platforms
#endif
}

#if defined(RH_PLATFORM_ARDUINO) && defined(ARDUINO_ARCH_RP2040)
void set_pico_alarm(uint32_t speed)
{
    uint32_t period = (1000000 / 8) / speed; // In microseconds
    uint64_t target = timer_hw->timerawl + period;
    timer_hw->alarm[RH_ASK_PICO_ALARM_NUM] = (uint32_t) target;
}
#endif

// The idea here is to get 8 timer interrupts per bit period
void RH_ASK::timerSetup()
{
#if (RH_PLATFORM == RH_PLATFORM_GENERIC_AVR8)
    uint16_t nticks;
    uint8_t prescaler = timerCalc(_speed, (uint16_t)-1, &nticks);
    if (!prescaler) return;
    _COMB(TCCR,RH_ASK_TIMER_INDEX,A)= 0;					
    _COMB(TCCR,RH_ASK_TIMER_INDEX,B)= _BV(WGM12);				
    _COMB(TCCR,RH_ASK_TIMER_INDEX,B)|= prescaler;				
    _COMB(OCR,RH_ASK_TIMER_INDEX,A)= nticks;					
    _COMB(TI,MSK,RH_ASK_TIMER_INDEX)|= _BV(_COMB(OCIE,RH_ASK_TIMER_INDEX,A));

#elif (RH_PLATFORM == RH_PLATFORM_MSP430) // LaunchPad specific
    // Calculate the counter overflow count based on the required bit speed
    // and CPU clock rate
    uint16_t ocr1a = (F_CPU / 8UL) / _speed;
    
    // This code is for Energia/MSP430
    TA0CCR0 = ocr1a;				// Ticks for 62,5 us
    TA0CTL = TASSEL_2 + MC_1;       // SMCLK, up mode
    TA0CCTL0 |= CCIE;               // CCR0 interrupt enabled

#elif (RH_PLATFORM == RH_PLATFORM_STM32L0)
    Serial.println("STM32L0 RH_ASK NOT YET IMPLEMENTED ");
    
#elif (RH_PLATFORM == RH_PLATFORM_STM32) || defined(ARDUINO_ARCH_STM32) || defined(ARDUINO_ARCH_STM32F1) || defined(ARDUINO_ARCH_STM32F3) || defined(ARDUINO_ARCH_STM32F4)
    // Maple etc
    // or rogerclarkmelbourne/Arduino_STM32
    // or stm32duino
    // Pause the timer while we're configuring it
    timer.pause();

 #ifdef BOARD_NAME
    // ST's Arduino Core STM32, https://github.com/stm32duino/Arduino_Core_STM32
    // Declaration of the callback function changed in 1.9. Sigh
  #if (STM32_CORE_VERSION >= 0x01090000)
    void interrupt();
  #else
    void interrupt(HardwareTimer*); // defined below
  #endif
    uint16_t us=(1000000/8)/_speed;
    timer.setMode(1, TIMER_OUTPUT_COMPARE);
    timer.setOverflow(us, MICROSEC_FORMAT);
    timer.setCaptureCompare(1, us - 1, MICROSEC_COMPARE_FORMAT);
  #if (STM32_CORE_VERSION >= 0x01090000)
    timer.attachInterrupt(interrupt);
  #else
    timer.attachInterrupt(1, interrupt);
  #endif

 #else
    void interrupt(); // defined below
    // Roger Clark Arduino STM32, https://github.com/rogerclarkmelbourne/Arduino_STM32
    timer.setPeriod((1000000/8)/_speed);
    // Set up an interrupt on channel 1
    timer.setChannel1Mode(TIMER_OUTPUT_COMPARE);
    timer.setCompare(TIMER_CH1, 1);  // Interrupt 1 count after each update
    void interrupt(); // defined below
    timer.attachCompare1Interrupt(interrupt);
 #endif    
    // Refresh the timer's count, prescale, and overflow
    timer.refresh();
    
    // Start the timer counting
    timer.resume();

#elif (RH_PLATFORM == RH_PLATFORM_ATTINY)
    // figure out prescaler value and counter match value
    // REVISIT: does not correctly handle 1MHz clock speeds, only works with 8MHz clocks
    // At 1MHz clock, get 1/8 of the expected baud rate
    uint16_t nticks;
    uint8_t prescaler = timerCalc(_speed, (uint8_t)-1, &nticks);
    if (!prescaler)
        return; // fault
 #if defined(RH_ASK_ATTINY_USE_TIMER1)
   #if defined(TCCR1)
    // ATtiny85
    TCCR1 = 0;
    TCCR1 = _BV(CTC1); // Turn on CTC mode / Output Compare pins disconnected

    // convert prescaler index to TCCR1 prescaler bits CS10, CS11, CS12, CS13
    TCCR1 |= prescaler; // set CS10, CS11, CS12, CS13 (other bits not needed)

    // Number of ticks to count before firing interrupt
    OCR1A = uint8_t(nticks);
    //  Number of ticks to count before counter reset (CTC mode)
    OCR1C = uint8_t(nticks);
    // Synchronous mode and PLL disabled
    PLLCSR = 0;
    // Set mask to fire interrupt when OCF1A bit is set in TIFR1
    TIMSK |= _BV(OCIE1A); 
   #else //TCCR1
    // ATtiny84
    TCCR1A = 0; // Output Compare pins disconnected
    TCCR1B = _BV(WGM12); // Turn on CTC mode

    // convert prescaler index to TCCRnB prescaler bits CS10, CS11, CS12
    TCCR1B |= prescaler;
    TCCR1C = 0;

    // Caution: special procedures for setting 16 bit regs
    // is handled by the compiler
    OCR1A = nticks;
    //enable interupt
    TIMSK1 |= _BV(OCIE1A);   
   #endif //
  #else //RH_ASK_ATTINY_USE_TIMER1
    TCCR0A = 0;
    TCCR0A = _BV(WGM01); // Turn on CTC mode / Output Compare pins disconnected

    // convert prescaler index to TCCRnB prescaler bits CS00, CS01, CS02
    TCCR0B = 0;
    TCCR0B = prescaler; // set CS00, CS01, CS02 (other bits not needed)


    // Number of ticks to count before firing interrupt
    OCR0A = uint8_t(nticks);

    // Set mask to fire interrupt when OCF0A bit is set in TIFR0
   #ifdef TIMSK0
    // ATtiny84
    TIMSK0 |= _BV(OCIE0A);
   #else
    // ATtiny85
    TIMSK |= _BV(OCIE0A);
   #endif
  #endif //RH_ASK_ATTINY_USE_TIMER1
#elif (RH_PLATFORM == RH_PLATFORM_ATTINY_MEGA)
    // If your processor does not have a TCB1, you can change the timer used in RadioHead.h
    volatile TCB_t* timer = &RH_ATTINY_MEGA_ASK_TIMER;

    // Calculate compare value
    uint32_t compare_val = F_CPU / _speed / 8 - 1;
    // If compare larger than 16bits, need to prescale (will be DIV64)
    if (compare_val > 0xFFFF)
    {
        // recalculate with new prescaler
        compare_val = F_CPU / _speed / 8 / 64 - 1;
	// Prescaler needed
        timer->CTRLA = TCB_CLKSEL_CLKTCA_gc;
    }
    else
    {
	// No prescaler needed
        timer->CTRLA = TCB_CLKSEL_CLKDIV1_gc;
    }

    // Timer to Periodic interrupt mode
    // This write will also disable any active PWM outputs
    timer->CTRLB = TCB_CNTMODE_INT_gc;
    // Write compare register
    timer->CCMP = compare_val;
    // Enable interrupt
    timer->INTCTRL = TCB_CAPTEI_bm;
    // Enable Timer
    timer->CTRLA |= TCB_ENABLE_bm;

#elif (RH_PLATFORM == RH_PLATFORM_ARDUINO) // Arduino specific


